{
    "https://online.nvcc.edu/faqs.html": {
        "How does online learning work at NOVA?": "Online learning courses may be 15 weeks, 12 weeks, 10 weeks, 8 weeks, or 5 weeks in length; each course has specific start, refund, first assignment due date, withdrawal, and end dates you should be aware of when you select a particular course. Note that any course shorter than 15 weeks in length is an accelerated course that will require more work per week than the standard 15-week course.Normally, students do not need to be online at a certain time, although some courses do have specific in-person or online meeting times for labs, online lectures, or class discussions.Regular submission of work is required. Some courses require students to meet frequent deadlines (such as weekly due dates), while others offer flexibility as to when assignments can be submitted.  In most courses, students must submit minimum required assignments as specified by the instructor to avoid being administratively withdrawn from the course.  Students should be sure to read all course information carefully when the course begins to understand the deadlines that apply in each course they are taking through NOVA Online.Exams are taken at any campus testing center or students outside the area may request exams be sent to a proctor.Students should complete the online orientation prior to registering for or beginning their online courses.",
        "What is the cost of an online learning course?": "The cost of enrolling in a course at NOVA is the same whether it is an online learning or traditional course. Check the NOVA Website under Tuition & Fees for the most current tuition rate.",
        "Do I need a valid NOVA student ID Card when taking online learning courses?": "Students enrolled in online learning courses do not normally need an NOVA student ID card unless they visit a campus-based facility (e.g. computer lab) or plan to print materials from a campus computer. It is generally recommended that students enrolled in online learning courses obtain a NOVA ID card.College policy states that all NOVA students are required to show their NOVA student IDs when they want to use an open computer lab. This includes students enrolled in online learning courses. In addition, in order to return textbooks at any VCCS bookstore, students must present a NOVA ID card.NOVA's pay-to-print service, FASTPrint, uses NOVA student IDs as debit cards for this service. Students can add money to their ID cards to print in the open computer labs or make copies in the libraries. This is especially helpful if one forgets an exam pass and needs to print one at the last moment for an exam in a campus testing center.",
        "If I can't find the course I need at NOVA, what are my other online learning options?": "NOVA offers many online learning course options, both campus-based and at NOVA Online. However, if you cannot find exactly what you need, we encourage you to look at these other possibilities such as:VCCS Online - The Virginia Community College System has twenty-three community colleges, many of them offer distance learning options.",
        "When can I register?": "Registration for NOVA Online learning courses begins at the same time as traditional campus courses at the beginning of each semester. However, NOVA Online also offers additional start dates later in the semester and students may register for these sections accordingly. When course capacity limits are reached, NOVA Online sections are closed to further registration. For more information see Important Dates on the Online Learning website.",
        "Where do I find the class number for an online learning course?": "You can find the class number in the current Schedule of Classes. Choose the term, subject, NOVA Online as the campus, Dynamic Session as the Session; click 'search.'  You will find a list of classes with the class number for each course.  This 5-digit number is also listed for each course in the printed Schedule of Classes.",
        "Where can I find online learning courses at NOVA?": "NOVA online learning courses are listed in the Schedule of Classes. Online learning course offerings can be found listed under each campus and in the section of the PDF Edition schedule of classes, under NOL - NOVA Online. Course listings are also available online on the NOVA Online Course Information page and in NOVAConnect  Click the Guest button, Guest Services; Catalog; View Schedule of Classes; Northern Virginia Community College; Term; Basis Search; Subject; Course; check the Open Only box; and choose VIRTUAL & NOVA Online in the Location box; click Search.",
        "Where can I locate additional online learning course sections that start later in the semester?": "Not all of NOVA Online's additional sections are listed in the printed Schedule of Classes. Additional sections offered are based on what courses reach their enrollment limits in the first registration session. If available, sections will be posted in the Announcements section on the NOVA Online website. They are also listed in NOVAConnect - Click the Guest button, Guest Services; Catalog; View Schedule of Classes; Northern Virginia Community College; Term; Basis Search; Subject; Course; check the Open Only box; and type VIRTUAL in the Location box; click Search.",
        "When does a course begin?": "Both campus-based online learning courses and NOVA Online learning courses start at the beginning of each semester. However, if you choose an NOVA Online learning course, the course start date may not be at the beginning of the semester. Additional NOVA Online learning course sections open periodically throughout the semester. Therefore, it is very important to check the Start Date on the Quick Start Syllabus you receive in the mail. (Some NOVA Online courses offer accelerated 12-, 10-, 8-, 5-week options to complete the course.)",
        "How do I start the course once I am registered?": "Your course will show in Canvas on the first day of class. Students will receive a Quick-Start syllabus to their NOVA student gmail account close to the start date of the class. If you have not received a Quick-Start syllabus within 3 days after the course has started, call NOVA Online Registration at (703) 323-3368. Students may also access the Course Description at http://online.nvcc.edu/courses.htm. Choose the semester, select the course and read the course description for required course materials, how to contact your instructor, etc.",
        "How do I drop my online learning course and receive a refund?": "You may drop a course and receive a refund by the Last Refund Date. Drop online with NOVAConnect. Drop by phone by calling (703) 323-3770 or (703) 330-3770 Prince William County residents.",
        "How do I withdraw from my online learning course without getting an F?": "You may withdraw from a course without grade penalty by the Last Date for Withdrawal. Drop online with NOVAConnect. DO NOT withdraw online if you are past your Last Date for Withdrawal. The system will assign an F. Students past their Last Date for Withdrawal must complete the Student Initiated Withdrawal Form and submit it to their instructor with supporting documentation.",
        "Why have I been dropped/withdrawn from my online learning course?": "Students enrolled in NOVA Online learning courses must sign into their Canvas course site and complete the First Assignment Due Date to avoid being administratively deleted without a tuition refund. If you have questions concerning an administrative withdrawal or believe that you have been dropped in error, you must contact your instructor.If you have questions concerning a drop for other reasons, you may contact the NOVA Online Registration office at (703) 323-3368.",
        "Why do I still have a 'W' grade if my instructor reinstated me in my NOVA Online learning course?": "Reinstatement in an NOVA Online learning course is by special permission of the instructor only. When instructors reinstate you in an NOVA Online learning course, they will mail a letter to you giving you permission to complete course assignments and take exams with the W on your record. You will need to take it with you to the testing center each time you take an exam.When all assignments and exams are completed, the W grade is changed to the final grade assigned by the instructor.",
        "What is the cost of course materials?": "The cost of course materials varies with each course. Almost all online learning courses require a textbook as a minimum. Other courses may require workbooks, CDs, videotape programs, course guides, or science lab supplies. If you have a specific course in mind, visit the NOVA Online Bookstore website or call the bookstore directly at (888) 744-7839.Students must present a NOVA ID in order to return textbooks at any VCCS bookstore.",
        "Where can I get course materials?": "Ordering books and other course materials for NOVA Online Learning courses can be done by any of the following methods: Online (preferred), phone, fax, or mail. For more information on these methods go to http://online.nvcc.edu/books/. All NOVA Online textbooks are available at the Alexandria Campus Bookstore. The other NOVA bookstores may carry texts for a limited number of NOVA Online Learning courses.  Before traveling to a campus bookstore, call ahead to confirm that your books are in stock.  For more information go to http://online.nvcc.edu/books/.",
        "If I go to the bookstore to buy my course materials and find that something isn't available, what should I do?": "You can call the Alexandria Bookstore at (888) 744-7839, be sure you specify that you are taking a NOVA Online course. All NOVA Online textbooks are available at the Alexandria Campus Bookstore. The other NOVA bookstores may carry texts for a limited number of NOVA Online Learning courses.  Before traveling to a campus bookstore, call ahead to confirm that your books are in stock.  For more information go to http://online.nvcc.edu/books/. If you need additional assistance, call the NOVA Online hotline, (703) 323-3347.",
        "What are the different types of online learning courses?": "Courses are designated as online and delivered on Canvas.",
        "How do I submit the assignments for my course?": "Students registered for online learning courses should consult their course syllabus on Canvas for detailed instructions.",
        "Can I drop off assignments to my instructor at their campus office?": "Refer to your course syllabus for specific instructions on how to submit assignments.",
        "Is online learning just an easy way to take a course?": "No. The content is the same, no matter how you decide to take the course, and although your professor for online learning courses is adapting the methods for teaching at a distance, you are expected to learn the same amount of material. Many students have expressed surprise that the online course is actually harder because it requires so much self-discipline.",
        "Will I interact with other students in the class?": "In online learning courses, interaction with other students is usually limited to online discussion forums in which messages are posted to the course website. A few courses require class meetingsthe dates and times are published in the printed and online Schedule of Classes for each semester.",
        "Do I ever have to go to campus?": "You may need to go to the campus testing center of your choice to take exams for your NOVA Online course. Any other required class meetings will be published in the Schedule of Classes or listed in the Course Syllabus.You may also need to go to the campus testing centers if you are planning to complete a certificate or degree at NOVA or are planning to take an English or math course. If you live outside the Washington, DC, metropolitan area, you can request to have a proctor outside NOVA to administer your exams. Refer to NOVA Online Policies and Procedures for all the details. In a few specialized courses, an on-campus lab is required.",
        "Can I work at my own pace?": "Yes, but keep in mind that each course has specific amounts of work that you must complete before the First Assignment Due Date or you will be administratively withdrawn. One of the benefits of taking an online learning course is the ability to study independently.Some online learning courses do not require fixed assignment due dates. However, research shows that students are most successful with independent study when they start their course work immediately and make steady progress. To help you accomplish this, most online learning courses offer a course progress schedule that you can follow.",
        "Can I complete the online learning course sooner than 15 weeks?": "Check with the individual instructor and your course information in the course syllabus for details. Students enrolled in many NOVA Online learning courses can accelerate the course assignments and schedule. For those courses, final grades are assigned as students finish the course. It is not easy to complete the course sooner than its end date. Plan to schedule 2-3 hours of study per credit hour. For example, for a 3-credit course, plan to study approximately 6-9 hours per week.",
        "What if I need more time to finish my NOVA Online learning course?": "If you have successfully completed the minimum amount of course work as specified by your instructor, you may request an Incomplete in writing from your instructor. An 'Incomplete' or 'I' grade is assigned and will change to your final grade when all assignments and exams have been completed. The length of the extension is determined by the instructor but can be up to 16 weeks.",
        "Do online learning courses and on-campus courses cover the same material?": "Generally, the instructional content of online learning courses is similar to what you study in a course on campus, but the online learning course may require a different textbook and types of assignments and exams. If you have a specific course in mind, refer to the Course Description for information about the textbook, types of assignments, and exams.",
        "Can I transfer courses from other colleges to NOVA?": "Course credits transfer only from colleges and universities that are accredited by the Commission on Colleges or the Commission on Higher Education of the regional accreditation associations or conform to the requirements published in the Transfer of Credit Practices of Designated Educational Institutions by the American Association of College Registrars and Admissions Officers. If you have a specific course in mind, contact an NOVA Online counselor at (703) 323-3347.",
        "Will my NOVA online learning courses transfer?": "NOVA is an accredited institution of higher learning. Because online learning courses are part of NOVA, they should transfer to any institution that accepts NOVA credits. However, it is always a good idea to check with the institution.",
        "How can a NOVA Online learning course be closed?": "NOVA Online learning courses do have limits as to the number of students that may register. Once the maximum number of students have been registered, the course is closed to additional students. Some NOVA Online learning courses have published closing dates due to required meetings, scheduled submission of assignments, and other course objectives that require the students to start the course at the same time.There are several reasons for course limits - state and college policies limit the number of credit hours faculty can teach; most faculty teach full-time on campus in addition to teaching their NOVA Online courses and these combined credit hours make up a full teaching load; availability of funds to pay for the credit hours faculty can teach.",
        "What is my start date?": "Your Start Date is the official start date for the course and all other dates are based on it. For NOVA Online learning courses, this date does not necessarily correspond to campus start dates.",
        "What are the important dates for my course?": "The important dates for your online learning course are the Start Date, Canvas Sign-in Date, Last Withdrawal Date Without F, and End Date. For NOVA Online learning courses, these dates are listed in the Quick-Start syllabus that is emailed to your NOVA student gmail account.Start Date: This is your official start date; all other dates are based on it. Your course start date does not necessarily correspond to campus course dates. You are expected to meet a schedule for submission of your work, so you need to buy your course materials and start on time.First Assignment Due Date: Students must log into their Canvas course site by this date and complete the first assignment to avoid being administratively deleted without a tuition refund.Last Refund Date: This is the last date on which you can drop your course and receive a refund of your tuition. This is also the last date on which you can drop your course and add another course without paying additional tuition. To drop your course, use the NOVAConnect online or telephone registration system.Last Date for Withdrawal: This is the last date on which you can withdraw from this course without grade penalty. Use the NOVAConnect online or telephone registration system to drop the course. You will receive a grade of 'W.' Instructors also have the option of withdrawing (without refund) students who are not meeting course progress requirements by the Last Withdrawal Date. However, students who expect a W are responsible for withdrawing themselves in NOVAConnect before the last withdrawal date.End Date: All assignments and examinations should be completed by this date. (Also see Incomplete Grades.)",
        "Can I submit assignments and take exams on my End Date for my NOVA Online learning course?": "If the testing center of your choice is open, you make take exams on your End Date. Plan to take your exam early as there may be a line at the testing center. Mailed assignments postmarked by the End Date will be accepted, but its also recommended that you email your instructor that an assignment has been mailed.",
        "Where can I find my final course grade?": "If your instructor has assigned a final grade, you can find out your grade by calling (703) 323-3770, option 2-Grades or by logging into NOVAConnect.If your instructor has not assigned a final grade, your grade will not be posted on NOVAConnect. Contact the instructor to check the status of your final grade. If you still require help locating your grade, contact the NOVA Online Hotline at (703) 323-3347 or (888) 435-6822.",
        "Will I ever meet my instructor?": "You can contact your instructor to make an appointment. Course syllabi provide your course instructor's office hours and contact information through email, voice mail, or telephone.",
        "How do I contact my instructor?": "Students can contact their instructors by email, by telephone, or voicemail. Students can make an appointment to meet face-to-face with the instructor. Some instructors have posted campus and NOVA Online office hours. Contact information is provided in the course syllabus or on the course website.",
        "Is there someone to help me?": "Your instructor is your primary support while taking an online learning course. In addition, the NOVA Online learning counselors and other staff are available to assist you if you have a question, problem, or concern related to your studies. Contact an NOVA Online learning student service counselor for answers to questions about financial aid, career planning, and tutors.",
        "Do online courses have exams?": "Yes, all NOVA courses have proctored exams.Proctored exams are a critical part of online courses. NOVA Online is required by The Higher Education Opportunity Act of 2008 (HEOA) and our accrediting body, The Southern Association of Colleges and Schools Commission on Colleges (SACSCOC), to verify the identities of every online student through secure logins and proctored examinations. Due to these strict guidelines, students who do not pass their proctored exams may fail their course regardless of their performance on homework and projects. For details about your course requirements, review your syllabus under Grading, Withdrawals, and Incompletes.",
        "How do I take exams for my NOVA Online learning course?": "Northern Virginia/Washington DC metropolitan area residents: you are required to take your exam at a NOVA testing center or to use our online proctoring service, ProctorU, if it is available in your course. You can take your exam at any one of NOVAs six campus testing centers (Manassas, Woodbridge, Springfield, Annandale, Alexandria and Loudoun). NOVA campus Testing CentersOther Virginia residents: You may take your exams at any Virginia Community College testing center, via our online proctoring service, ProctorU, if it is available in your course, or at the testing center of another Virginia college/university at which you are a student (you submit a Proctor Request Form for approval - NOVA Online Proctor Request Form). Use the College Locator feature on the Virginia Community College System (VCCS) website to find a college near you. http://www.vccs.edu/.Students in other states: You may take your exams at a college/university testing center near you (you must submit a Proctor Request Form for approval - NOVA Online Proctor Request Form), or via our online proctoring service, ProctorU, if it is available in your course.Students needing an accommodation based on a disability that prevents them from traveling to a college testing center should contact NOVA Online for help in identifying an appropriate proctor. Call (703) 323-3347 or 1-888-435-6822 or email onlinecoursespecialists@nvcc.edu.Active duty and deployed service members may request proctoring through a military education or test control officer.Proctor Request Instructions and Proctor Request Form - NOVA Online Proctor Request Form",
        "Do I need an NOVA student ID to take my exams?": "When taking a test at an NOVA campus testing center, you will need to bring your exam pass and a photo ID. It does not have to be an NOVA student ID.If you forget your exam pass and need to print one at the last moment in a campus computer lab or library, you will have to pay for printing the pass. NOVA's pay-to-print service, FASTPrint, uses NOVA student IDs as debit cards for this service. Students can add money to their ID cards to print in the open computer labs or make copies in the libraries.To request a proctor, complete the NOVA Online Proctor Request Form and submit it with your proctor's statement on letterhead to NOVA Online (see the Proctor Request Form for details.)",
        "How do I know which technology I will be using?": "The NOVA Online section of the Schedule of Classes describes the type of technology used in each course. Specific course information can be obtained from the Course Syllabus which can be downloaded from the NOVA Online Learning Website. If you are using dial-up, you may have trouble accessing some course materials and may need to use a public or work computer for some of your course work.",
        "I have a computer. What else will I need?": "If you are taking an online course, prior experience using an Internet connection and a browser is required. All online learning courses require regular Internet access.  Because most communication between faculty and students occurs by email, we recommend the following:reliable access to emailreliable access to the Internet (with a recent version of a browser such as Firefox, Chrome, or Safari)MS Office (mainly needed for word-processing in order to complete assignments.)access to software such as Adobe Reader, RealPlayer, etc.",
        "Can I use any kind of browser?": "You must use a standard Web browser such as Firefox, Chrome, Safari, or Microsoft Internet Explorer. You must enable cookies and Java to access most courses.",
        "What if my course isn't listed in Canvas?": "Prior to the beginning of the semester, most course websites are under revision so students will not be able to access their Canvas course right away. Check the NOVA Online Learning website for details on accessing your NOVA Online course website. If your course is not listed by the Start Date listed on your Quickstart Syllabus, contact the NOVA Online Hotline at (703) 323-3347 or (888) 435-6822.",
        "May I use computers on any NOVA college campus?": "Yes, college policy states that all NOVA students are required to show their NOVA student IDs when they want to use an open computer lab. This includes students enrolled in online learning courses. NOVA's pay-to-print service, FASTPrint, uses NOVA student IDs as debit cards for this service. Students can add money to their ID cards to print in the open computer labs or make copies in the libraries. This is especially helpful if one forgets an exam pass and needs to print one at the last moment for an exam in a campus testing center.",
        "What disciplines does NOVA Online need faculty to teach?": "Our needs at NOVA Online are always changing.  We often have need for faculty to teach common general education courses such as English composition, basic math, and introductory economics or other social science courses.  However, we also often have need for faculty to teach more specialized courses.  The best way to find out what we need at a given time is simply to contact us at TeachOnline@nvcc.edu.  If we do not need faculty in your area at that time, we will keep your contact information on file for future consideration as our needs change.",
        "What are NOVA Online courses like?": "NOVA Online courses are designed to give students an interactive learning experience. Every course is different in the technology tools employed and the types of assignments used to engage students. Some courses are self-paced, allowing students to complete assignments on a schedule most convenient for them, while others require students to meet regular (often weekly or bi-weekly) deadlines. When you are assigned a course to teach, a fellow faculty member or an instructional designer will review the whole course with you to be sure you are comfortable with its structure and content. In order to maintain course integrity, we require that you teach the course as currently designed, making no changes to course content, structure, or assignments without permission from NOVA Online.",
        "If the course is already designed, what do I do as a teacher?": "Your role as a teacher in an online course is to support, guide, and provide feedback to students as they move through the material. This includes sending students regular reminders about making progress and meeting course deadlines; participating in class discussion forums; answering student questions and doing one-on-one tutoring or advising by email/chat/phone/audio conferencing; and grading and providing helpful feedback on student assignments.",
        "What qualifications do faculty need to teach at NOVA Online?": "To teach at NOVA Online, you must hold a Masters Degree and have successfully completed 18 graduate credit hours in the discipline you will teach. Faculty who have community college teaching experience, and/or experience teaching online, are preferred.",
        "What is the compensation for teaching at NOVA Online?": "NOVA Online faculty are paid at the same rates as other college faculty. Adjunct faculty pay is determined by Human Resources based on degrees held and past teaching experience. The Academic Dean interviewing you can give you an estimate of the pay you might receive. (See below for more on the hiring process.) Pay for NOVA Online courses, however, is pro-rated based on enrollments (if you have low enrollment, your pay will be reduced accordingly). We can discuss our workload policies and formulas further with you as you explore teaching for NOVA Online.",
        "What course management system does NOVA Online use?": "NOVA Online courses are delivered using Canvas. NOVA Online faculty are expected to complete training in Canvas in order to be competent using its range of features, including discussion boards, posting documents, using the assignment feature, using the gradebook, and creating and deploying exams. Canvas training is offered on all six NOVA campuses and online. Faculty who live out of the area but need Canvas training may be able to self-train using online training materials, or find training in their area.",
        "What training and expertise are faculty required to have in order to teach for NOVA Online?": "In addition to the ability to use the range of features in Canvas, as mentioned above, NOVA Online faculty are expected to participate in a half-day new-faculty orientation session to learn about administrative policies and procedures and best practices in online teaching. (For faculty who live out of the Northern Virginia region, arrangements can be made to participate from a distance.) And, since NOVA Online courses are taught online, we expect our faculty to be competent and comfortable with email and the basic office software necessary for record-keeping and communicating with students and NOVA Online staff.",
        "What support will be available for me once I begin teaching?": "NOVA Online has a full staff available to support our faculty in their work. You can call the NOVA Online Hotline, email our instructional design help team, contact our Canvas administration team, or chat with our Faculty Liaison or Coordinator of Faculty and Student support if you are having any kinds of problems, from technical problems to student problems. Depending on the course you are teaching, you may also have a Course Coordinator (an experienced NOVA Online instructor who teaches the same course) or a faculty mentor who can help support you in your teaching.",
        "How do I apply to teach for NOVA Online?": "If you are qualified to teach online and are interested in teaching for us, please send a resume/CV and cover letter to TeachOnline@nvcc.edu.  Your experience and credentials will be reviewed, you will be contacted for further information if necessary, and your background will be examined to see if you might fit with our current staffing needs.  If your experience does fit our current needs, NOVA Online will put you in contact with an Academic Dean on one of the NOVA campuses, who will interview you and complete the actual hiring process."
    },
    "https://www.nvcc.edu/medical/apply/steps/faq.html": {
        "How can I start attending a program at the Medical Education Campus?": "Your first step is to attend the program Information Session. The Information Session will provide details about the application requirements and how and when you may apply. Some programs have online Information Sessions that you can review at any time while other programs may require attendance at an in-person session or online real-time video conference. Information Sessions may be updated annually. A list of Information Sessions is available at www.nvcc.edu/medical/infosessions/. Keep the Information Session Code as you will need it to submit an online Health Sciences & Nursing application.",
        "I have a previous college degree. Do I still need to take ENG 111 College Composition?": "Yes, you must either take or transfer ENG 111 and have completed it with the required minimum grade. Some programs require a minimum grade of B to apply so remember to check your transcript to make sure you meet the grade requirement. Your degree does not waive ENG 111, but you may request transfer credit evaluation to see if a previous course will transfer.",
        "I need to declare a major to complete the prerequisites or to request transfer credit evaluation. What should I do?": "Applicants to the Health Sciences and Nursing programs will not be placed in their desired program until after official acceptance. If you have not already declared a major when you applied to NOVA, or you are not already placed in a credit program, you may declare the General Studies Health Sciences major to complete the prerequisites or to request transfer credit evaluation. If needed, send an email with your name and student ID number to virtualadvising@nvcc.edu to request placement in the General Studies Health Sciences major.",
        "My program says that the prerequisite requires a B or better grade, but I got a C. Does this mean that I have to take the course again?": "Yes, you would have to take the course again and get a B or better grade to be eligible to apply. Your application will not be accepted if you do not have the minimum grade requirements.",
        "I took SDV 100 or another SDV course. Do I still have to take SDV 101 Intro to Healthcare?": "No. You do not have to take SDV 101 if you have successfully completed another SDV course.",
        "I took the SDV ABLE exam. Do I still have to take SDV 101 Intro to Healthcare?": "No. You do not have to take SDV 101 if you have successfully completed the SDV ABLE exam.",
        "I have a previous degree. Do I still have to take SDV 101 Intro to Healthcare?": "The current policy, as outlined in the NOVA Credit for Prior Learning Manual, states that those, 'who have graduated with an associate, baccalaureate or higher degree from a regionally accredited United States institution of higher education are considered to have fulfilled NOVAs SDV requirement.' If you meet this criteria then you do not have to take SDV 101 Intro to Healthcare. You will need to submit an official transcript to the NOVA College Records Office showing your previous degree to receive credit.",
        "I have been to college but have not graduated. Can I still have SDV waived?": "You may also satisfy the SDV 101 requirement via testing. The SDV Able Exam is available to take at any campus. Passing the exam will meet the SDV 101 requirement.",
        "Will my international medical degree waive the application requirements?": "International medical degrees, training and work experience do not exempt students from any application requirements.  A course-by-course evaluation of your college and university transcripts will be required by an international evaluation agency to determine if any program requirements have already been met. Refer to the Transfer Credit Evaluation process for international transcripts.",
        "I completed a CLEP or AP exam for a prerequisite. How does my score translate to a course grade?": "CLEP Exam Course Grade EquivalentsAP Exam Course Grade Equivalents",
        "I have taken classes or earned a previous degree at another college/university. How can I get credit for these classes?": "Refer to the Request Transfer Credit Evaluation step on the Steps to Apply website for the Medical Education Campus. This will explain the steps and will also provide important evaluation information for applicants to the Health Sciences and Nursing programs.While waiting for evaluation, you may check if your school is listed in the Transfer Evaluation System to view what courses have previously transferred to NOVA. If your course and/or school are not listed in TES, you may still be eligible for credit but will need to wait for your evaluation to be completed by the CRO.",
        "How does NOVA transfer minus grades?": "NOVA does not use minus grades so applicants need to pay attention to how minus grades will transfer to the college, especially if applying to a program that has a minimum grade requirement.A - grade transfers as/is considered a B for application to the programB - grade transfers as/is considered a C for application to the programC - grade does not transfer/is considered a D for application to the program",
        "I completed high school outside the United States and my program requires proof of high school. How can I get my transcript evaluated?": "Note: This question only applies to the Dental Assisting, Medical Laboratory Assisting, Nursing, and Phlebotomy programs. All other programs at MEC do not require proof of high school.If your high school was outside of the United States, your transcript must be evaluated course-by-course by an international evaluation service before submitting it to NOVA. The college accepts international high school evaluations from the International Education Research Foundation (IERF) www.ierf.org. Please do not use World Education Services (WES) as they will not evaluate high school transcripts on a course-by-course basis.Transfer Credit Evaluation ProcessTranscript evaluation may take up to 12 weeks so request evaluation as EARLY as possible.",
        "How do I check the status of my transfer credit evaluation?": "You can check the outcome of your transfer credit evaluation by logging onto myNOVA and accessing your transfer credit report on the Student Information System (SIS). myNOVA > SIS > Self Service > Transfer Credit > View Transfer Credit ReportmyNOVA: https://www.nvcc.edu/academic-tools/index.html",
        "I think there was an error in my transfer credit evaluation. Who should I contact?": "Send an email to the College Records Office at askthecro@nvcc.edu. Be sure to include your name, student ID number, MEC program you are applying to, and what your question is or list what specific courses you would like re-evaluated.",
        "I submitted my transfer credit evaluation so why has my application been rejected?": "Transfer credit evaluation can take up to 12 weeks and is completed by the College Records Office. You must allow enough time for your evaluation to be completed, and all transfer credit must be posted to your record before you apply. Otherwise, you accept the risk of your application being rejected if you apply before the evaluation is completed. The CRO cannot rush evaluations, and MEC staff cannot evaluate transcripts. Your application will not be held pending completion of transfer credit evaluation and will be rejected for missing requirements.",
        "What is the TEAS test and why do I have to take it?": "The Test for Essential Academic Skills (TEAS) is a timed, computer-based assessment used by schools nationwide to evaluate the academic preparedness of students seeking to gain admission to medical education programs. If your program requires the TEAS, you must complete it and meet any minimum score requirements to apply.More Information: MEC TEAS Test",
        "I have a previous degree. Do I still have to take the TEAS test?": "Yes. All applicants to programs that require the TEAS must complete it and meet any minimum score requirements.More Information: MEC TEAS Test",
        "Where can I get study materials for the TEAS test?": "Purchase a study guide from atitesting.com or borrow a copy from the MEC libraryRequest access from MEC Tutoring to a free practice test and recorded review sessionNOVA does not currently offer any TEAS prep courses",
        "How do I sign up to take the TEAS test?": "Refer to the Take TEAS Test step on the How to Apply to the Health Sciences and Nursing programs website.",
        "How long are my test scores valid?": "TEAS scores are good for 3 years. Remember to verify the dates you took the exams to make sure your scores have not expired.",
        "I already applied to NOVA so why cant I register now for a program at the MEC?": "Medical education programs include student learning experiences called clinicals that are held at a local hospital, doctors office, or other patient care facility. Due to the limited number of available  sites, each program can only accept a specific number of students each year and require a separate application process. There are prerequisites that must be met to apply, and some programs are first-come/first-served while other programs are competitive. Interested students should attend the program Information Session to find out the requirements and how and when to apply.",
        "Im an international/out-of-state student. Can I apply to the MEC programs?": "All students who have met the required prerequisites may apply to the programs. However, international and out-of-state students should note the following priority admission policy:'Due to limited laboratory, classroom and/or clinical space, certain Health Sciences and Nursing programs have restricted enrollment. As stated in the NOVA catalog, Health Sciences and Nursing students are accepted on either a competitive or a first-come/first-served basis with priority given to: Legal residents domiciled in the cities and counties supporting the CollegeOther Virginia legal residentsOut-of-state applicantsInternational students requiring Form I-20Category 1 may include areas in which clinical affiliates have contractual agreements with NOVA or students from other VCCS service areas whose community college does not offer the specific program.'This policy is established by the Virginia Community College System and is stated in section 6.0.5 Admission Priorities of the VCCS Policy Manual which reads:'When enrollments must be limited for any curriculum, priority shall be given to all qualified applicants who are residents of the political subdivisions supporting the college and to Virginia residents not having access to a given program at their local community college, provided such students apply for admission to the program prior to registration or by a deadline established by the college.  In addition, residents of localities with which the college has clinical-site or other agreements may receive equal consideration for admission.'",
        "Do I have to get my physical, CPR or background check before I apply to the program?": "No, these clinical requirements are not required to apply to the program.",
        "Can I take the general education courses before I apply to the program?": "Yes, you may take any of the general education electives before applying. Some programs award points in the competitive admission process for taking these courses early. However, students planning to use financial aid should be aware that this may reduce the amount of aid received during the program.",
        "I am applying to the Nursing program. Do I really have to attach proof of high school?": "Yes. In addition to the college requirements, the Virginia Board of Nursing requires proof of completion of high school algebra, high school biology, and high school chemistry with a C or better grade, and proof of high school graduation from all applicants. It does not matter if you attended college or have a previous degree. You must attach a transcript showing that you completed these high school requirements. If you attended high school outside of the United States, your transcript must be evaluated by an international evaluation agency before submitting it to NOVA. If you do not attach proof of completion of the high school requirements, your application will be marked as incomplete.Refer to the Nursing Application Checklist on the Nursing website for more information.",
        "How competitive are the programs at the Medical Education Campus?": "Each competitive admission program has its own admission criteria that is reviewed and determines how candidates are ranked. The applicant pool can be very different from year to year so what is considered a competitive score one year can be less competitive the following year. It depends on the number of applications received, the number of students that can be accepted, and the quality of the applications received for that admission cycle. For the best chance of acceptance, applicants will want to focus on being as competitive as possible versus just meeting the minimum requirements to apply.",
        "Is there a wait list for the program?": "No. There are no wait lists for the Health Sciences & Nursing programs at MEC. If you are not accepted to the program, then you must reapply during the next open application cycle.",
        "I missed the deadline to submit my application. Is there anything else I can be doing while Im waiting to apply to the next session?": "You may complete any of the general education courses within the program while you are waiting to apply. However, students planning to use financial aid should be aware that this may reduce the amount of aid received during the program. You may also retake any prerequisite courses to obtain a better grade to make yourself more competitive and increase your chance of being accepted to your desired program. If you have already completed the electives and have the highest possible grades, then you will have to wait for the next application cycle to apply.",
        "I have met the requirements. How do I apply to the program?": "Fill out and submit an online Health Sciences & Nursing application. You will need to know your myNOVA login to access the form. Be sure you also have all the additional documents to attach to your application if required by your program. Have the Information Session Code from the online or in-person Information Session that you attended. You will receive a confirmation email after submitting the application.",
        "Where do I get the Information Session Code for my online application?": "You should have already attended an Information Session for your program to learn about the requirements. It is important to familiarize yourself with this session since you are certifying you have reviewed it and agree that you meet the requirements when submitting your application. Codes may change every year, so it is important to always revisit the Information Session every application cycle if you do not apply right away.Important! Enter the code EXACTLY as provided. Pay attention to spacing and capitalization. The Information Session Code field on the application is programmed to only accept the exact code.Online Info Sessions: Online information sessions include the code in the online presentation. It may not always be at the end and may possibly be spoken instead of being displayed on the screen.In-Person or Live Zoom Sessions: In-person or live Zoom information sessions may be required for some programs. The code for the application will be provided at the end of the session.EMS Program: Contact the EMS Program Office at 703.822.6639 to get the EMS Program Information Session.",
        "What should I do if I am having technical problems with the online application?": "Submit an email to applymec@nvcc.edu. Include your name, ID number, program and screenshots of any error messages you are getting or provide a detailed description of the issue you are experiencing. Please do not call or email the College Call Center or the program office to report an issue. If you are facing a program deadline, your application may still be considered only if you followed procedure by sending an email to ApplyMEC by the deadline so your issue can be investigated.",
        "How long will it take for my application to be processed?": "Continue to check your student email account for status updates. EMS applicants should allow at least 10 business days. All other applicants should allow up to 8 weeks after the program deadline to receive an email that the application criteria has been verified. If you receive an email stating that further information or documentation is needed to continue processing your application, you must respond by the provided deadline. If you do not respond or take action to correct your application, it will not be forwarded to the department and will be rejected. Allow up to 12 weeks after the program deadline to receive final notification from the program.",
        "What are the steps in the application review process?": "There are 4 steps of application review:Step 1  review of application criteriaStep 2  domicile reviewStep 3  ranking of applicantsStep 4  final notification from the programAllow up to 12 weeks after the program deadline to receive final notification from the program.",
        "Why did I get an email stating my application is incomplete?": "If an ApplyMEC advisor found that you have not met the application criteria, they will request further information. You will receive an email that your application is incomplete and needs additional attention. Your application is not rejected at this point. Your application could be incomplete for any of the following reasons:missing course(s)not having the minimum grade requiredno transfer credit evaluation or the evaluation was submitted too latenot having a required attachmentscience courses are too oldno proof of attendance at the required Information Sessionnot having the minimum required cumulative GPAIf you received the email before the program deadline, you have until that deadline to correct your application. If it is after the program deadline, you will be given a new date of when you must have corrected your application to still be considered. All applications initially put in the Incomplete Requirements queue will be reviewed again for the incomplete requirements. Applications that are still found to be incomplete will not move forward, and you will receive a final email that you were not eligible for the program.If you feel that you received this email by mistake, follow the directions provided in the email to contact ApplyMEC. This is the fastest way to correct your application if a mistake was made.",
        "Why did I get an email that my application was rejected?": "If you received a final email after the deadline stating that your application has been rejected then you were not eligible to apply. Your application could have been rejected for any of the following reasons:missing course(s)not having the minimum grade requiredno transfer credit evaluation or the evaluation was submitted too latenot having a required attachmentscience courses are too oldno proof of attendance at the required Information Sessionnot having the minimum required cumulative GPAIf you did not respond by the deadline provided to correct your application or you were unable to correct your application in time, then you will receive a final email that your application has been rejected. You are welcome to reapply to the next application cycle once you have corrected the requirements that you were missing.",
        "Can I work full-time and still attend the program?": "The programs at the MEC are intensive, and it is highly recommended that students work no more than 20 hours while attending the program. Any work schedules that students have must be arranged around the designated days and times for the lectures, labs, and clinical rotations for the program.",
        "How much does the program cost?": "Current tuition costs for NOVA can be found at http://www.nvcc.edu/tuition/index.html. Students can use the current tuition rate and multiply this by the number of required credits for their desired program to find an approximate cost of the program. Program curriculums are available in the current college catalog at http://www.nvcc.edu/curcatalog/. Tuition rates are subject to change. Additional fees are required for textbooks, uniforms and program patches, any required lab or clinical equipment, and any applicable licensure application or testing fees.",
        "How will I know if I have been accepted to the program?": "The program office will notify applicants of their admission status. It is the responsibility of the applicant to respond by the deadline to officially accept any admission offers and to attend the mandatory program orientation. Students who do not respond by the provided deadline or who fail to show for the program orientation will be replaced with another applicant. Allow up to 12 weeks after the program deadline to receive final notification from the program.",
        "Will I be assigned an advisor who will help me once I get into my program?": "Students will be assigned a faculty advisor after being accepted to their program. Academic advising is available through Advising and Counseling office for students completing the prerequisites for their program.",
        "Can I defer my acceptance to another year if I am unable to attend right now?": "No. You would have to apply to the program again during the next application cycle if you are unable to accept admission.",
        "I met all of the application requirements. Why wasnt I accepted to the program?": "Acceptance to the Health Sciences & Nursing programs is not guaranteed even after meeting the minimum application requirements. Each program can only accept a specific number of applicants due to limited clinical availability. Programs that are first-come, first-served will accept applicants according to the date and time of their application up to the maximum number they can accept. Once this maximum number is reached then the program is closed.Competitive admission programs will rank all applicants by their published competitive admission criteria and will accept students from this list up to the maximum number they can accept. If an accepted applicant decides to decline admission, then they are replaced by the next applicant on the list. If more applicants applied to a program then there is space, unfortunately, some applicants have to be turned away. There are no waitlists so applicants would have to attend another Information Session for any new requirements, and then reapply to the program in the next application cycle."
    },
    "https://online.nvcc.edu/testinginfo.html": {
        "How will I take my proctored assessments?": "Similar to campus-based courses, faculty will be proctoring your assessments virtually during a scheduled day and time using either Respondus Monitor and Respondus Lockdown Browser and/or Zoom Live proctoring scenarios.",
        "What technology is required for NOVA Online proctoring?": "The proctored solution your course uses determines which software you will use for your assessment. All software associated with NOL assessments are free/available throughout the college.The chief piece of hardware needed besides your computer is a functioning webcam.Zoom Live Proctoring is conducted in the Zoom web client or application. Respondus Lockdown Browser and Monitor are extensions of the Canvas learning management system and accessed as part of the exam itself. Respondus Lockdown Browser is a specialized browser for taking quizzes in Canvas. It prevents printing, copying, and accessing other websites or applications during an assessment. If a Canvas quiz requires Lockdown Browser to be used, you will not be able to take the quiz with a standard web browser. Respondus Monitor is an add-on to the Lockdown Browser that records video of your a testing session and is shared with your instructor.",
        "How do I download Respondus Lockdown Browser and Respondus Monitor for the first time?": "The link to download the VCCS Respondus Lockdown Browser and directions are located within each course.What is Lockdown Browser? https://web.respondus.com/lockdownbrowser-student-video/Use this Quick Guide for the first time Users - https://web.respondus.com/wp-content/uploads/2019/08/RLDB-QuickStartGuide-Instructure-Student.pdf",
        "I have an academic accommodation through Disability Support Services that allows me to use Assistive Technology for my coursework. Will it work with Respondus?": "Respondus Lockdown Browser is not compatible with Assistive Technology. Students using Assistive Technology will be provided access to a copy of the assessment, which does not use Lockdown browser. Generally speaking in these situations, a reader/scribe would be assigned to support the student in taking the test. To request a reader/scribe, contact disabilityservices@nvcc.edu.",
        "I have been approved by my faculty member to take an assessment with an alternate qualified proctor. How can I obtain my assessment?": "Complete the NOVA Online Proctor Request Form and submit it with your proctor's statement on letterhead to NOVA Online (see the Proctor Request Form for details). Please note on the form if you are requesting to take the English or Math Placement Assessment.Proctor requests may take up to 5 business days to process.All students will receive an email confirmation when the assessments have been sent to the proctor.All proctor requests must be verified. Delays in submitting your request and delays in response to the verification process with your proctor may result in missed assessments and grade penalties. DO NOT wait until the last minute to submit proctor requests.",
        "Who is considered a qualified alternate proctor?": "Qualified Proctors include testing centers at an accredited college or university. Active duty and deployed military personnel may submit a proctor request for an approved military educational or test control officer. Students needing an accommodation based on a disability should contact NOVA Online for help in identifying an appropriate proctor.In documented mitigating circumstances, a full-time faculty member at an accredited college or university may be eligible, provided we can verify their employment status and the assessments are taken at a college or university office with a computer provided by the test proctor.Proctors cannot be a family member, employer, friend, co-worker, or someone with whom the student has any personal relationship. Proctors also cannot be an adjunct faculty member, teaching assistant, athletic coach, or student worker.**Students requesting a testing accommodation must have a memorandum on file with NOVAs Office of Disability Services, prior to taking assessments. Accommodations are not retroactive and will not be granted without following the process as outlined by NOVAs Office of Disability Services. Accommodations must relate to online courses.",
        "How do I take a Math or English Placement Assessment?": "Placement testing at NOVA has changed since going remote. Please visit https://www.nvcc.edu/safe-campus/placement.html for up to date information on how to safely place into your appropriate math or English course."
    },
    "https://www.nvcc.edu/campus-auxiliary-services/faq.html": {
        "How can I get a refund from a vending machine?": "Please send an email to NOVACAS@nvcc.edu with a brief description of the vending issue. Please include your Student ID / NOVACard number; the vending machine number (located on a sticker on the front of all machines); the product item or location you were trying to purchase; and the requested refund amount.All refunds will go to your NOVACard / ACE$ account.Refunds will be processed in 3-5 business days.",
        "How do I buy books if the bookstore is closed?": "Customers can place bookstore orders online at https://nvcc.bncollege.com/.",
        "If I have any catering related questions, whom should I contact?": "Please send us an email at NOVACAS@nvcc.edu with your catering question.",
        "How do I add money to my NOVACard?": "There are several ways to add funds to your NOVACard:At any deposit machine on any NOVA campus.At any NOVACard office on any campus.Using NOVACard's online service, GET or use online services mobile app GET",
        "Who do I contact to file a complaint about a dining service issue?": "Please send us an email at NOVACAS@nvcc.edu with any questions or concerns regarding dining services.",
        "Do you offer Kosher or Halal menu items?": "Yes, we offer Kosher and Halal menu options. www.eurocafeusa.com/menu/.",
        "Do you have Gluten free options?": "Yes, we offer gluten free menu options. www.eurocafeusa.com/menu/.",
        "I was overcharged for a food item at the cafe, how do I get a refund?": "The cafe will issue your refund directly from their POS system. Please visit the cafe, and they will assist you.",
        "Does the college offer a meal plan?": "There are no meal plan options at this time.",
        "Can the Cafes accommodate dietary restrictions?": "Yes. Please let the cafe know of any dietary needs as you place your order.",
        "How can I give feedback about your campus services?": "Please send us an email at NOVACAS@nvcc.edu with any questions, comments, or concerns regarding auxiliary services."
    },
    "https://online.nvcc.edu/fservices/index.html": {
        "What disciplines does NOVA Online need faculty to teach?": "Our needs at NOVA Online are always changing. We often have need for faculty to teach common general education courses such as English composition, basic math, and introductory economics or other social science courses. However, we also often have need for faculty to teach more specialized courses. The best way to find out what we need at a given time is simply to contact us. If we do not need faculty in your area at that time, we will keep your contact information on file for future consideration as our needs change.",
        "What are NOVA Online courses like?": "NOVA Online courses are designed to give students an interactive learning experience. Every course is different in the technology tools employed and the types of assignments used to engage students. Some courses are self-paced, allowing students to complete assignments on a schedule most convenient for them, while others require students to meet regular (often weekly or bi-weekly) deadlines. When you are assigned a course to teach, a fellow faculty member or an instructional designer will review the whole course with you to be sure you are comfortable with its structure and content. In order to maintain course integrity, we require that you teach the course as currently designed, making no changes to course content, structure, or assignments without permission from NOVA Online.",
        "If the course is already designed, what do I do as a teacher?": "Your role as a teacher in an online course is to support, guide, and provide feedback to students as they move through the material. This includes sending students regular reminders about making progress and meeting course deadlines; participating in class discussion forums; answering student questions and doing one-on-one tutoring or advising by email/chat/phone/audio conferencing; and grading and providing helpful feedback on student assignments.",
        "What qualifications do faculty need to teach at NOVA Online?": "To teach at NOVA Online, you must hold a Masters Degree and have successfully completed 18 graduate credit hours in the discipline you will teach. Faculty who have community college teaching experience, and/or experience teaching online, are preferred.",
        "What requirements are there for teaching to students outside of Virginia?": "Northern Virginia Community College, as a member of the National Council for State Authorization Reciprocity Agreements, has reciprocal agreements with most states to allow students living in those states to take online courses through NOVA Online. Additional information can be found at the following links:Commonwealth of Virginia Policy on the Reciprocal Authorization of Online Education and Related Activities (State Committee on Transfer)State Authorization Reciprocity Agreements Policies and Standards (National Council for State Authorization Reciprocity Agreements)",
        "What is the compensation for teaching at NOVA Online?": "NOVA Online faculty are paid at the same rates as other college faculty. Adjunct faculty pay is determined by Human Resources based on degrees held and past teaching experience. The Academic Dean interviewing you can give you an estimate of the pay you might receive. (See below for more on the hiring process.) Pay for NOVA Online courses, however, is pro-rated based on enrollments (if you have low enrollment, your pay will be reduced accordingly). We can discuss our workload policies and formulas further with you as you explore teaching for NOVA Online.",
        "What course management system does NOVA Online use?": "NOVA Online courses are delivered using Canvas Learning Management System. NOVA Online faculty are expected to complete training in Canvas in order to be competent using its range of features, including discussion boards, posting documents, using the assignment feature, using the gradebook, and creating and deploying exams. Canvas training is offered on all six NOVA campuses. Faculty who live out of the area but need Canvas training may be able to self-train using online training materials, or find training in their area.",
        "What training and expertise are faculty required to have in order to teach for NOVA Online?": "In addition to the ability to use the range of features in Canvas, as mentioned above, NOVA Online faculty are expected to participate in a half-day new-faculty orientation session to learn about administrative policies and procedures and best practices in online teaching. (For faculty who live out of the Northern Virginia region, arrangements can be made to participate from a distance.) And, since NOVA Online courses are taught online, we expect our faculty to be competent and comfortable with email and the basic office software necessary for record-keeping and communicating with students and NOVA Online staff.",
        "What support will be available for me once I begin teaching?": "NOVA Online has a full staff available to support our faculty in their work. You can call the NOVA Online Hotline, email our instructional design help team, contact our Canvas administration team, or chat with our Faculty Liaison or Coordinator of Faculty and Student support if you are having any kinds of problems, from technical problems to student problems. Depending on the course you are teaching, you may also have a Course Coordinator (an experienced NOVA Online instructor who teaches the same course) or a faculty mentor who can help support you in your teaching.",
        "How Do I Get Involved in Teaching at NOVA Online": "If you are qualified to teach online and are interested in teaching for us, please fill our Faculty Readiness Assessment Form. As part of your submission you will be expected to upload a copy of your current CV/Resume and transcripts that indicate the required 18 credit hours in the discipline for which you are applying.We will review your experience and credentials, contact you for further information if necessary, and examine how your background might fit with our current staffing needs. If your experience does fit our current needs, NOVA Online will put you in contact with an Academic Dean on one of the NOVA campuses, who would interview you and complete the actual hiring process.",
        "What is NOVA Onlines intellectual property policy?": "NOVA Onlines intellectual property policy is governed by the statewide policy described in the VCCS Policy Manual here.",
        "Do NOVA Online courses require proctored exams? Why?": "To comply with accreditation requirements and best practices in distance learning, all NOVA Online courses must verify the identity of the student earning the grade in the online course. In the vast majority of NOVA Online courses, we accomplish this through proctored exams, which students take online using Respondus Lock-down Browser, an online proctoring service. In a few cases, instructors verify student identity instead through an in-person learning activity such as a lab, public speech, or internship work. In either case, courses must be structured such that a student cannot pass the course without passing the proctored exam/activity."
    }
}